/*
 * Задание 2.
 Выведите на консоль ваши ФИО, адрес и телефон.
 
Date: 10.02.2017
Author: Anastasiya Findziukevich
 */
package com.epam.java_training.ls2.printtasks;

import com.epam.java_training.ls2.util.Util;

public class Task2 {

	public static void doMain() {
		// TODO Auto-generated method stub
		Util.printBegin(2);
		System.out.println("ФИО - Финдюкевич Анастасия Евгеньевна.");
		System.out.println("Адрес - г. Минск, проспект Независимости 58.");
		System.out.println("Телефон - 8 (029) 322 46 49");
		Util.printEnd(2);
		
	}

}
