/*
 * Задание 1.
Скачайте и установите JDK и IDE. Создайте java-проект и запустите приложение
Hello, world!

Date: 10.02.2017
Author: Anastasiya Findziukevich
*/
package com.epam.java_training.ls2.printtasks;

import com.epam.java_training.ls2.util.Util;

public class Task1 {

	public static void doMain() {
		Util.printBegin(1);
		System.out.println("Hello, world!");
		Util.printEnd(1);
	}

}
